performance-test.yml
# Performance Test Configuration for Artillery.js

config:
  target: 'http://localhost:8080'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
  payload:
    path: "./users.csv"
    fields:
      - "email"
      - "password"
  variables:
    baseUrl: "http://localhost:8080"

scenarios:
  - name: "Authentication Flow"
    weight: 70
    flow:
      - get:
          url: "/"
          capture:
            - json: "$.csrfToken"
              as: "csrfToken"
      - think: 2
      - get:
          url: "/login.html"
      - think: 5
      - post:
          url: "/api/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
            csrfToken: "{{ csrfToken }}"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 1
      - get:
          url: "/dashboard"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Registration Flow"
    weight: 20
    flow:
      - get:
          url: "/signup.html"
      - think: 10
      - post:
          url: "/api/signup"
          json:
            fullName: "Test User {{ $randomString() }}"
            email: "test{{ $randomInt(1, 10000) }}@example.com"
            password: "password123"

  - name: "Static Assets"
    weight: 10
    flow:
      - get:
          url: "/"
      - get:
          url: "/login.html"
      - get:
          url: "/signup.html"